#include "tasks.h"

/*
 * -------------------Легко---------------------
 * Это задание похоже на первое задание
 * в файле tasks. 
 * Запишите в result число 42.
 *
 * Примечание:
 * здесь и далее под выражением
 * "запишите в result"
 * подразумевается запись в переменную,
 * на которую указывает *result
 * 
 * Через return верните 0
 */
int firstPointer(int *result) {
    return NOT_IMPLEMENTED;      // TODO
}
 
 /*
 * -------------------Легко---------------------
 * Верните в return адрес, хранящийся в указателе
 */
int whatsInside(int *p) {
    return NOT_IMPLEMENTED;      // TODO
}
 

 /*
 * -----------------Нормально-------------------
 * Где-то в памяти компьютера спрятан секретный код!
 * Точный адрес неизвестен, но были найдены
 * следующие инструкции:
 *   От стартовой точки пройдите 4 целых шага вперед
 *   Там вы найдёте зашифрованный код
 *   Ключ к шифру лежит в соседней ячейке слева
 *   Чтобы расшифровать код, перемножьте код с ключом
 * Вам нужно найти этот код и вернуть его в return
 */
int investigating(int *start) {
    return NOT_IMPLEMENTED;      // TODO
}
